; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-7)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	image2 - mode
	image1 - mode
	image0 - mode
	image3 - mode
	Star3 - direction
	GroundStation2 - direction
	Star1 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Phenomenon5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image3)
	(calibration_target instrument0 Star1)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument3 image0)
	(supports instrument3 image2)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument4 image1)
	(supports instrument4 image0)
	(calibration_target instrument4 Star1)
	(supports instrument5 image2)
	(supports instrument5 image0)
	(supports instrument5 image1)
	(calibration_target instrument5 Star1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
	(supports instrument6 image2)
	(supports instrument6 image1)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation4)
	(supports instrument7 image3)
	(supports instrument7 image0)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
)
(:goal (and
	(pointing satellite1 Star1)
	(pointing satellite2 Phenomenon5)
	(have_image Phenomenon5 image0)
	(have_image Star6 image1)
	(have_image Star7 image0)
	(have_image Planet8 image0)
	(have_image Planet9 image3)
	(have_image Planet10 image0)
	(have_image Planet11 image2)
))

)

; plan
1. (turn_to satellite1 star1 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star1)
   goals met: 1 of 9
2. (turn_to satellite0 star1 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star1)
   goals met: 1 of 9
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 9
4. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 1 of 9
5. (turn_to satellite0 star6 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star6)
   goals met: 1 of 9
6. (take_image satellite0 star6 instrument0 image1)
   added: (have_image star6 image1)
   goals met: 2 of 9
7. (turn_to satellite2 star1 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 star1)
   goals met: 2 of 9
8. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 2 of 9
9. (calibrate satellite2 instrument5 star1)
   added: (calibrated instrument5)
   goals met: 2 of 9
10. (turn_to satellite2 star7 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 star7)
   goals met: 2 of 9
11. (take_image satellite2 star7 instrument5 image0)
   added: (have_image star7 image0)
   goals met: 3 of 9
12. (turn_to satellite2 planet11 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 planet11)
   goals met: 3 of 9
13. (take_image satellite2 planet11 instrument5 image2)
   added: (have_image planet11 image2)
   goals met: 4 of 9
14. (turn_to satellite0 planet9 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet9)
   goals met: 4 of 9
15. (take_image satellite0 planet9 instrument0 image3)
   added: (have_image planet9 image3)
   goals met: 5 of 9
16. (turn_to satellite2 planet8 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet8)
   goals met: 5 of 9
17. (take_image satellite2 planet8 instrument5 image0)
   added: (have_image planet8 image0)
   goals met: 6 of 9
18. (turn_to satellite2 planet10 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 planet10)
   goals met: 6 of 9
19. (take_image satellite2 planet10 instrument5 image0)
   added: (have_image planet10 image0)
   goals met: 7 of 9
20. (turn_to satellite2 phenomenon5 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon5)
   goals met: 8 of 9
21. (take_image satellite2 phenomenon5 instrument5 image0)
   added: (have_image phenomenon5 image0)
   goals met: 9 of 9
